# BuiltInFailures.DirectContext3DFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DirectContext3DFailures Class
BuiltInFailures Class Members See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class DirectContext3DFailures
```

Visual Basic
---
```text
Public NotInheritable Class DirectContext3DFailures
```

Visual C++
---
```text
public ref class DirectContext3DFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..DirectContext3DFailures
# See Also
BuiltInFailures..::..DirectContext3DFailures Members
Autodesk.Revit.DB Namespace